# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
ser1 = pd.Series(np.random.randint(0, 5, 100))
ser2 = pd.Series(np.random.randint(0, 4, 100))
ser3 = pd.Series(np.random.randint(10_000, 30_000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.DataFrame({'first': ser1, 'second': ser2, 'third': ser3})
df.head()

   first  second  third
0      1       2  18469
1      1       1  22687
2      3       1  16406
3      1       3  23175
4      0       1  18074

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename({'first': 'bedrs', 'second': 'bathrs', 'third': 'price_sqr_meter'}, axis=1, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            18469
1      1       1            22687
2      3       1            16406
3      1       3            23175
4      0       1            18074

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
pd.concat([ser1, ser2, ser3], axis=0)

0         2
1         4
2         4
3         0
4         3
5         4
6         2
7         1
8         4
9         3
10        4
11        2
12        1
13        3
14        4
15        0
16        3
17        0
18        2
19        1
20        4
21        3
22        2
23        4
24        4
25        3
26        4
27        3
28        4
29        4
      ...
70    19800
71    27425
72    25114
73    27402
74    19883
75    20200
76    19973
77    27967
78    24709
79    15709
80    16139
81    22540
82    12711
83    18856
84    19741
85    18672
86    15630
87    20732
88    29516
89    27307
90    27631
91    12103
92    27549
93    17980
94    11626
95    17181
96    21384
97    20874
98    15377
99    27232
Length: 300, dtype: int32

### Step 6. Ops it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299